class Question:
    def __init__(self, que, answer, right_v1, v2, v3):
        self.que = que

        self.answer = answer

        self.right_v1 = right_v1
        self.v2 = v2
        self.v3 = v3


first_que = Question("С какого года Шамиль становится имамом Дагестана?",
                     "Правильный ответ – в 1834 г. авторитетными дагестанскими алимами Шамиль в с. Чирката избирается имамом Дагестана, после его ему принесли присягу.",
                     "1834",
                     "1830",
                     "1836")

second_que = Question("Строил ли Шамиль церкви для русских перебежчиков?",
                      "Правильный ответ – Нет, поскольку в исламе это является грехом.",
                      "Нет",
                      "Да",
                      "Хотел но не успел")

third_que = Question("За взятие какого аула в России была утверждена серебряная медаль?",
                     "Правильный ответ – Ахульго. За взятие Ахульго на Монетном дворе в Санкт-Петербурге была отчеканена серебряная медаль, которой были награждены 12595 участников сражения.",
                     "Ахульго",
                     "Гергебиль",
                     "Гуниб")

fourth_que = Question("Почему Шамиль не ввел собственные деньги в имамате?",
                      "Правильный ответ – Посчитал ненужным. Имам не решился предпринять выпуск своих денег, дабы не осложнять торговые отношения с горскими народами, подконтрольными русской военной администрации, где эти деньги не могли иметь хождения и, таким образом, явились бы мертвым капиталом.",
                      "Посчитал ненужным",
                      "не было средств",
                      "не позволил противник")

fifth_que = Question("В какой воинский чин возвела Шамиля Турция?",
                     "Правильный ответ – Генералиссимус. Кроме посылки Шамилю орденов и подарков, султан в 1854 г. официально возвел имама в звание «генералиссимуса черкесской и грузинской армии»,",
                     "Генералиссимус",
                     "Маршал",
                     "Генерал")

que6 = Question("В каком селении родился Шамиль?",
                "Правильный ответ - Гимры",
                "Гимры",
                "Хунзах",
                "Гуниб")

que7 = Question("Каким было его первоначальное имя?",
                "Ответ - Али",
                "Али",
                "Махмуд",
                "Мухаммад")

que8 = Question("К чему у Шамиля было сильное влечение в юные годы?",
                "Ответ - к учебе",
                "к учебе,",
                "к войне",
                "к путешествиям")

que9 = Question("В каком году погиб имам Гази-Мухаммад?",
                "1832",
                "1832",
                "1834",
                "1833")

que10 = Question("Кто стал имамом после смерти Гази-Мухаммада? ",
                 "ответ - Гамзат",
                 "Гамзат",
                 "Шамиль",
                 "Ахвердилав")

que11 = Question("Где получил опасную рану Шамиль?",
                 "ответ - в Гимринском ущелье.",
                 "в Гимринском ущелье",
                 "в Гунибе",
                 "в Хунзахе")

que12 = Question("Где произошло избрание имамом Шамиля? ",
                 "ответ - в Чиркате",
                 "В Чиркате",
                 "В Гунибе",
                 "В Темир-Хан-Шуре.")

que13 = Question("Сколько лет Шамиль был имамом?",
                 "Ответ - 25",
                 "25",
                 "26",
                 "10")

que14 = Question("Как назывались элитные войска в имамате?",
                 "ответ - Муртазеки",
                 "Муртазеки",
                 "Мюриды",
                 "Охотники")

que15 = Question("Как назывались ракеты, бывшие на вооружении в армии Шамиля?",
                 "Ответ - Ракеты Конгрива",
                 "Ракеты Конгрива",
                 "Мортиры",
                 "Единороги")

que16 = Question("В чем заключается главная заслуга Шамиля в реформировании своей армии?",
                 "Ответ - создание артиллерии",
                 "Создание артиллерии.",
                 "Подготовка ополчения.",
                 "Усовершенствование кавалерии.")

que17 = Question("В каком году Шамиль отменил крепостную зависимость?",
                 "Ответ - 1843",
                 "1843",
                 "1850",
                 "1859")

que18 = Question("За чей счёт содержались в имамате беглые русские солдаты?",
                 "Ответ - байт ал-мал",
                 "Байт ал-мал ( государственная казна имамата)",
                 "Шамиля",
                 "За счёт самих солдат ")

que19 = Question("Кто из русских врачей давал лестную оценку медицине горцев?",
                 "Ответ - Пирогов",
                 "Пирогов",
                 "Вишневский",
                 "Склифосовский")

all_que = [first_que, second_que, third_que, fourth_que, fifth_que, que6, que7, que8, que9, que10, que11, que12, que13, que14, que15, que16, que17, que18, que19]

